ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_rtdma_ch_regs.xml
<module id="HSM_RTDMA_CH" HW_revision="" description="HSM RTDMA CH Registers">
	<group id="chan_ctrl" name="chan_ctrl" instances="8" offset="0x0" instaddr="4096">
		<register id="MODE" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="PERINTSEL" description="" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="OVRINTE" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PERINTE" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CHINTMODE" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ONESHOT" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CONTINUOUS" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="DATASIZE" description="" begin="18" end="17" width="2" rwaccess="RW"/>
		<bitfield id="CHINTE" description="" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="WRT_DATASIZE" description="" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="RESERVED_2" description="" begin="31" end="22" width="10" rwaccess="R"/>
		</register>
		<register id="CONTROL" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="RUN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HALT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOFTRESET" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PERINTFRC" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PERINTCLR" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ERRCLR" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PERINTFLG" description="" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="TRANSFERSTS" description="" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="BURSTSTS" description="" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="RUNSTS" description="" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="OVRFLG" description="" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="15" width="17" rwaccess="R"/>
		</register>
		<register id="BURST_SIZE" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="BURSTSIZE" description="" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="8" width="24" rwaccess="R"/>
		</register>
		<register id="BURST_COUNT" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="BURSTCOUNT" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="8" width="24" rwaccess="R"/>
		</register>
		<register id="SRC_BURST_STEP" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="SRCBURSTSTEP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="DST_BURST_STEP" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="DSTBURSTSTEP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="TRANSFER_SIZE" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="TRANSFERSIZE" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="TRANSFER_COUNT" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="TRANSFERCOUNT" description="" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="SRC_TRANSFER_STEP" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="SRCTRANSFERSTEP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="DST_TRANSFER_STEP" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="DSTTRANSFERSTEP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="SRC_WRAP_SIZE" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="WRAPSIZE" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="SRC_WRAP_COUNT" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="WRAPSIZE" description="" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="SRC_WRAP_STEP" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="WRAPSTEP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="DST_WRAP_SIZE" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="WRAPSIZE" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="DST_WRAP_COUNT" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="WRAPSIZE" description="" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="DST_WRAP_STEP" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="WRAPSTEP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="SRC_BEG_ADDR_SHADOW" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="BEGADDR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SRC_ADDR_SHADOW" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="ADDR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SRC_BEG_ADDR_ACTIVE" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="BEGADDR" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="SRC_ADDR_ACTIVE" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="ADDR" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="DST_BEG_ADDR_SHADOW" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="BEGADDR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="DST_ADDR_SHADOW" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="ADDR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="DST_BEG_ADDR_ACTIVE" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="BEGADDR" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="DST_ADDR_ACTIVE" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="ADDR" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="RESERVED_1" width="32" page="0" offset="96" instances="8" instaddr="4" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CHSECLAT1" width="32" page="0" offset="128" internal="0" description="">
		<bitfield id="ZONE" description="" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="LINK" description="" begin="11" end="8" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_2" description="" begin="15" end="12" width="4" rwaccess="R"/>
		<bitfield id="APILINK" description="" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_3" description="" begin="23" end="20" width="4" rwaccess="R"/>
		<bitfield id="STACK" description="" begin="27" end="24" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_4" description="" begin="31" end="28" width="4" rwaccess="R"/>
		</register>
		<register id="CHSECLAT2" width="32" page="0" offset="132" internal="0" description="">
		<bitfield id="SECURE" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="7" end="1" width="7" rwaccess="R"/>
		<bitfield id="PRIV" description="" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="RESERVED_2" description="" begin="15" end="10" width="6" rwaccess="R"/>
		<bitfield id="PRIVID" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="RESERVED_3" description="" begin="31" end="24" width="8" rwaccess="R"/>
		</register>
		<register id="RESERVED_2" width="32" page="0" offset="136" instances="6" instaddr="4" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="BURST_INTF_CTRL" width="32" page="0" offset="160" internal="0" description="">
		<bitfield id="BURSTCTRL" description="" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="2" width="30" rwaccess="R"/>
		</register>
		<register id="RESERVED_3" width="32" page="0" offset="164" instances="23" instaddr="4" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CHCFG_LOCK" width="32" page="0" offset="256" internal="0" description="">
		<bitfield id="LOCK" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="1" width="31" rwaccess="R"/>
		</register>
		<register id="CHCFG_COMMIT" width="32" page="0" offset="260" internal="0" description="">
		<bitfield id="COMMIT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="1" width="31" rwaccess="R"/>
		</register>
		<register id="RESERVED_4" width="32" page="0" offset="264" instances="957" instaddr="4" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="RESERVED_5" width="32" page="0" offset="4092" internal="0" description="">
		<bitfield id="RESERVED" description="" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
	</group>
</module>
